README.md
```mermaid
classDiagram
    class User {
        Long id
        String username
        String email
        Boolean active
    }
    class Role {
        Long id
        String description
    }
    class UserData {
        Long id
        String firstName
        String lastName
        String address
        String phoneNumber
    }
    User "n" -- "m" Role
    User "1" *-- "1" UserData
```
